Config/DataProcessors/УправлениеНомерамиИнвентарныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УправлениеНомерамиИнвентарныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестровыйНомер</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ограничить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/ИнвентарныеНомераОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИнвентарныеНомераОС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомерУОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDИнвентарногоНомераУОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомерЗаимствованный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомерЗаимствуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обременения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбременения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрацииДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрацииНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбремененияВид</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбремененияДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбремененияНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/УправлениеНомерамиИнвентарныхОбъектов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ДеревоНомеров.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Организация Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	
	ДеревоНомеров.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = ОсновноеСредство Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоНомеров

&НаКлиенте
Процедура ДеревоНомеровПометкаПриИзменении(Элемент)
	
	ИзменитьФлажокИнв(Элементы.ДеревоНомеров.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДерево(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЗаводскойНомер)
		И Не ЗначениеЗаполнено(Объект.РеестровыйНомер)
		И Не ЗначениеЗаполнено(Объект.НомерПаспорта)
		И Не ЗначениеЗаполнено(Объект.ДатаВыпуска) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не заполнены характеристики'"));
	Иначе
		ЗаполнитьДеревоКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого СтрокаОС Из ДеревоНомеров.ПолучитьЭлементы() Цикл
		СтрокаОС.Пометка = Истина;
		ИзменитьФлажокИнв(СтрокаОС);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаОС Из ДеревоНомеров.ПолучитьЭлементы() Цикл
		СтрокаОС.Пометка = Ложь;
		ИзменитьФлажокИнв(СтрокаОС);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъект(Команда)
	
	ТекущиеДанные = Элементы.ДеревоНомеров.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Объект) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНомера(Команда)
	
	МассивОС = ПеренестиНомераСервер();
	РаскрытьВсеСтрокиДерева();
	
	Для Каждого ЭлементОС Из МассивОС Цикл
		ПараметрыОповещения = Новый Структура("Ссылка", ЭлементОС);
		Оповестить("ЭлементОсновныеСредстваЗаписан", ПараметрыОповещения);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодставитьЗаводскойНомер(Команда)
	
	Объект.ЗаводскойНомер = ПолучитьХарактеристику("ЗаводскойНомер");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьРеестровыйНомер(Команда)
	
	Объект.РеестровыйНомер = ПолучитьХарактеристику("РеестровыйНомер");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьНомерПаспорта(Команда)
	
	Объект.НомерПаспорта = ПолучитьХарактеристику("НомерПаспортаРегистрационный");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьДатаВыпуска(Команда)
	
	Объект.ДатаВыпуска = ПолучитьХарактеристику("ДатаВыпуска");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Для строки "Основное средство"
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоНомеровРеестровыйНомерНовый");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоНомеровЗаводскойНомерНовый");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоНомеровНомерПаспортаНовый");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоНомеровДатаВыпускаНовая");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "ДеревоНомеров.ЭтоОС", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Для строки "Инвентарный номер"
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоНомеровПометка");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "ДеревоНомеров.ЭтоОС", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоКлиент()
	
	ЗаполнитьДеревоСервер();
	РаскрытьВсеСтрокиДерева();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоСервер()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.УстановитьПараметр("РеестровыйНомер"	, Объект.РеестровыйНомер);
	Запрос.УстановитьПараметр("ЗаводскойНомер"	, Объект.ЗаводскойНомер);
	Запрос.УстановитьПараметр("НомерПаспорта"	, Объект.НомерПаспорта);
	Запрос.УстановитьПараметр("ДатаВыпуска"		, Объект.ДатаВыпуска);
	Запрос.УстановитьПараметр("ПустоеСвойство"	, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	|	ЕСТЬNULL(Доп_РеестровыйНомер.Значение, """") КАК РеестровыйНомерОС,
	|	ЕСТЬNULL(Доп_ЗаводскойНомер.Значение, """") КАК ЗаводскойНомерОС,
	|	ЕСТЬNULL(Доп_НомерПаспорта.Значение, """") КАК НомерПаспортаОС,
	|	ЕСТЬNULL(Доп_ДатаВыпуска.Значение, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыпускаОС,
	|	ЕСТЬNULL(ИнвентарныеОбъекты.Ссылка, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ИнвентарныеОбъекты.РеестровыйНомер, """") КАК РеестровыйНомер,
	|	ЕСТЬNULL(ИнвентарныеОбъекты.ЗаводскойНомер, """") КАК ЗаводскойНомер,
	|	ЕСТЬNULL(ИнвентарныеОбъекты.НомерПаспорта, """") КАК НомерПаспорта,
	|	ЕСТЬNULL(ИнвентарныеОбъекты.ДатаВыпуска, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыпуска,
	|	ВЫБОР
	|		КОГДА НЕ Доп_РеестровыйНомер.Значение ЕСТЬ NULL
	|				ИЛИ НЕ Доп_ЗаводскойНомер.Значение ЕСТЬ NULL
	|				ИЛИ НЕ Доп_НомерПаспорта.Значение ЕСТЬ NULL
	|				ИЛИ НЕ Доп_ДатаВыпуска.Значение ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьДанные
	|ПОМЕСТИТЬ ВТ_ОС
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеОбъекты
	|		ПО ОсновныеСредства.Ссылка = ИнвентарныеОбъекты.ОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК Доп_РеестровыйНомер
	|		ПО ОсновныеСредства.Ссылка = Доп_РеестровыйНомер.Ссылка
	|			И (Доп_РеестровыйНомер.Свойство = &РеестровыйНомер)
	|			И (Доп_РеестровыйНомер.Свойство <> &ПустоеСвойство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК Доп_ЗаводскойНомер
	|		ПО ОсновныеСредства.Ссылка = Доп_ЗаводскойНомер.Ссылка
	|			И (Доп_ЗаводскойНомер.Свойство = &ЗаводскойНомер)
	|			И (Доп_ЗаводскойНомер.Свойство <> &ПустоеСвойство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК Доп_НомерПаспорта
	|		ПО ОсновныеСредства.Ссылка = Доп_НомерПаспорта.Ссылка
	|			И (Доп_НомерПаспорта.Свойство = &НомерПаспорта)
	|			И (Доп_НомерПаспорта.Свойство <> &ПустоеСвойство)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК Доп_ДатаВыпуска
	|		ПО ОсновныеСредства.Ссылка = Доп_ДатаВыпуска.Ссылка
	|			И (Доп_ДатаВыпуска.Свойство = &ДатаВыпуска)
	|			И (Доп_ДатаВыпуска.Свойство <> &ПустоеСвойство)
	|ГДЕ
	|	ОсновныеСредства.Организация = &Организация
	|	И ОсновныеСредства.Ссылка = &ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 0
	|	ВТ_ОС.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ СписокОС
	|ИЗ
	|	ВТ_ОС КАК ВТ_ОС
	|ГДЕ
	|	ВТ_ОС.ЕстьДанные
	|	И &УсловиеЗаполнености
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОС.РеестровыйНомерОС КАК РеестровыйНомерОС,
	|	ВТ_ОС.ЗаводскойНомерОС КАК ЗаводскойНомерОС,
	|	ВТ_ОС.НомерПаспортаОС КАК НомерПаспортаОС,
	|	ВТ_ОС.ДатаВыпускаОС КАК ДатаВыпускаОС,
	|	ВТ_ОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_ОС.РеестровыйНомер КАК РеестровыйНомер,
	|	ВТ_ОС.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВТ_ОС.НомерПаспорта КАК НомерПаспорта,
	|	ВТ_ОС.ДатаВыпуска КАК ДатаВыпуска
	|ИЗ
	|	ВТ_ОС КАК ВТ_ОС
	|ГДЕ
	|	ВТ_ОС.ОсновноеСредство В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				СписокОС КАК ВТ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|ИТОГИ ПО
	|	ОсновноеСредство";
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОсновныеСредства.Организация = &Организация", "ИСТИНА");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсновноеСредство) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОсновныеСредства.Ссылка = &ОсновноеСредство", "");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 0", ?(ЗначениеЗаполнено(Объект.Ограничить), "ПЕРВЫЕ " + Формат(Объект.Ограничить, "ЧГ=0"), ""));
	
	Условие = "
	|	ИЛИ ВТ_ОС.РеестровыйНомер <> """"
	|	ИЛИ (ВЫРАЗИТЬ(ВТ_ОС.ЗаводскойНомер КАК СТРОКА(1))) <> """"
	|	ИЛИ (ВЫРАЗИТЬ(ВТ_ОС.НомерПаспорта КАК СТРОКА(1))) <> """"
	|	ИЛИ ВТ_ОС.ДатаВыпуска <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеЗаполнености", ?(ПеренесенныеТоже, Условие, ""));
	
	Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Дерево = РеквизитФормыВЗначение("ДеревоНомеров");
	Дерево.Строки.Очистить();
	
	Для Каждого СтрокаОС Из Результат.Строки Цикл
		
		СтрокаДерева = Дерево.Строки.Добавить();
		
		Для Каждого СтрокаНомер Из СтрокаОС.Строки Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаНомер.ИнвентарныйНомер) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДереваИнв = СтрокаДерева.Строки.Добавить();
			СтрокаДереваИнв.Объект					= СтрокаНомер.ИнвентарныйНомер;
			СтрокаДереваИнв.РеестровыйНомерТекущий	= СтрокаНомер.РеестровыйНомер;
			СтрокаДереваИнв.ЗаводскойНомерТекущий	= СтрокаНомер.ЗаводскойНомер;
			СтрокаДереваИнв.НомерПаспортаТекущий	= СтрокаНомер.НомерПаспорта;
			СтрокаДереваИнв.ДатаВыпускаТекущая		= СтрокаНомер.ДатаВыпуска;
			СтрокаДереваИнв.Пометка					= Истина;
			СтрокаДереваИнв.ЭтоОС					= Ложь;
			СтрокаДереваИнв.БезИнвентарногоНомера	= 1;
			
			СтрокаДереваИнв.ДатаВыпускаНовая = ?(ЗначениеЗаполнено(СтрокаНомер.ДатаВыпуска), СтрокаНомер.ДатаВыпуска, СтрокаНомер.ДатаВыпускаОС);
			
		КонецЦикла;
		
		СтрокаДерева.Объект					= СтрокаНомер.ОсновноеСредство;
		СтрокаДерева.РеестровыйНомерТекущий	= СтрокаНомер.РеестровыйНомерОС;
		СтрокаДерева.ЗаводскойНомерТекущий	= СтрокаНомер.ЗаводскойНомерОС;
		СтрокаДерева.НомерПаспортаТекущий	= СтрокаНомер.НомерПаспортаОС;
		СтрокаДерева.ДатаВыпускаТекущая		= СтрокаНомер.ДатаВыпускаОС;
		СтрокаДерева.Пометка				= Истина;
		СтрокаДерева.ЭтоОС					= Истина;
		СтрокаДерева.БезИнвентарногоНомера	= 1;
		
		Если СтрокаДерева.Строки.Количество() = 0 Тогда
			
			СтрокаДерева.БезИнвентарногоНомера = 0; // Будет показан знак предупреждения
			
		Иначе
			
			ЗаполнитьНомерОбъектов(СтрокаДерева, "РеестровыйНомер");
			ЗаполнитьНомерОбъектов(СтрокаДерева, "ЗаводскойНомер");
			ЗаполнитьНомерОбъектов(СтрокаДерева, "НомерПаспорта");
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоНомеров");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомерОбъектов(СтрокаОС, ТипНомера)
	
	ПереносимыйНомер = СокрЛП(СтрокаОС[ТипНомера + "Текущий"]);
	
	Если СтрокаОС.Строки.Количество() = 1 Тогда
		СтрокаИнв = СтрокаОС.Строки[0];
		НомерТекущий = СокрЛП(СтрокаИнв[ТипНомера + "Текущий"]);
		СтрокаИнв[ТипНомера + "Новый"] = ?(ЗначениеЗаполнено(НомерТекущий), НомерТекущий, ПереносимыйНомер);
		Возврат;
	КонецЕсли;
	
	Разделитель = Неопределено;
	Если СтрНайти(ПереносимыйНомер, ",") > 0 Тогда
		Разделитель = ",";
	ИначеЕсли СтрНайти(ПереносимыйНомер, ";") > 0 Тогда
		Разделитель = ";";
	КонецЕсли;
	
	Если Разделитель = Неопределено Тогда
		МассивНомеров = Новый Массив;
		МассивНомеров.Добавить(ПереносимыйНомер);
	Иначе
		МассивНомеров = СтрРазделить(ПереносимыйНомер, Разделитель);
	КонецЕсли;
	
	НомерОбъекта = 1;
	КоличествоНомеров = МассивНомеров.Количество();
	
	Для Каждого СтрокаИнв Из СтрокаОС.Строки Цикл
		
		НомерНовый = ?(НомерОбъекта > КоличествоНомеров, МассивНомеров[0], МассивНомеров[НомерОбъекта-1]);
		НомерТекущий = СокрЛП(СтрокаИнв[ТипНомера + "Текущий"]); 
		СтрокаИнв[ТипНомера + "Новый"] = ?(ЗначениеЗаполнено(НомерТекущий), НомерТекущий, СокрЛП(НомерНовый));
		
		НомерОбъекта = НомерОбъекта + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиНомераСервер()
	
	Дерево = РеквизитФормыВЗначение("ДеревоНомеров");
	
	ОбработанныеСтроки = Новый Массив;
	ОбработанныеОС = Новый Массив;
	
	УстаревшиеРеквизиты = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ЗаводскойНомер) Тогда
		УстаревшиеРеквизиты.Добавить(Объект.ЗаводскойНомер);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РеестровыйНомер) Тогда
		УстаревшиеРеквизиты.Добавить(Объект.РеестровыйНомер);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.НомерПаспорта) Тогда
		УстаревшиеРеквизиты.Добавить(Объект.НомерПаспорта);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДатаВыпуска) Тогда
		УстаревшиеРеквизиты.Добавить(Объект.ДатаВыпуска);
	КонецЕсли;
	
	Для Каждого СтрокаОС Из Дерево.Строки Цикл
		
		Если СтрокаОС.Пометка Тогда
			
			Попытка
				
				НачатьТранзакцию();
				
				ПеренестиНомераОС(СтрокаОС, УстаревшиеРеквизиты);
				
				ЗафиксироватьТранзакцию();
				ОбработанныеСтроки.Добавить(СтрокаОС);
				ОбработанныеОС.Добавить(СтрокаОС.Объект);
				
			Исключение
				ОтменитьТранзакцию();
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ОбрСтрока Из ОбработанныеСтроки Цикл
		Дерево.Строки.Удалить(ОбрСтрока);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоНомеров");
	
	Возврат ОбработанныеОС;
	
КонецФункции

&НаСервере
Процедура ПеренестиНомераОС(СтрокаОС, УстаревшиеРеквизиты)
	
	ОСОбъект = СтрокаОС.Объект.ПолучитьОбъект();
	
	КолВо = ОСОбъект.ДополнительныеРеквизиты.Количество();
	Для Сч = 1 По КолВо Цикл
		СтрокаДоп = ОСОбъект.ДополнительныеРеквизиты[КолВо - Сч];
		Если УстаревшиеРеквизиты.Найти(СтрокаДоп.Свойство) <> Неопределено Тогда
			ОСОбъект.ДополнительныеРеквизиты.Удалить(СтрокаДоп);
		КонецЕсли;
	КонецЦикла;
	
	Если ОСОбъект.Модифицированность() Тогда
		ОСОбъект.Записать();
	КонецЕсли;
	
	Для Каждого СтрокаИнв Из СтрокаОС.Строки Цикл
		
		Если СтрокаИнв.РеестровыйНомерНовый = СтрокаИнв.РеестровыйНомерТекущий 
			И СтрокаИнв.ЗаводскойНомерНовый = СтрокаИнв.ЗаводскойНомерТекущий
			И СтрокаИнв.НомерПаспортаНовый = СтрокаИнв.НомерПаспортаТекущий
			И СтрокаИнв.ДатаВыпускаНовая = СтрокаИнв.ДатаВыпускаТекущая Тогда
			Продолжить;
		КонецЕсли;
		
		ИнвОбъект = СтрокаИнв.Объект.ПолучитьОбъект();
		
		ИнвОбъект.РеестровыйНомер	= СтрокаИнв.РеестровыйНомерНовый;
		ИнвОбъект.ЗаводскойНомер	= СтрокаИнв.ЗаводскойНомерНовый;
		ИнвОбъект.НомерПаспорта		= СтрокаИнв.НомерПаспортаНовый;
		ИнвОбъект.ДатаВыпуска		= СтрокаИнв.ДатаВыпускаНовая;
		
		ИнвОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьВсеСтрокиДерева()
	
	Для Каждого СтрокаОС Из ДеревоНомеров.ПолучитьЭлементы() Цикл
		Элементы.ДеревоНомеров.Развернуть(СтрокаОС.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажокИнв(СтрокаОС)
	
	Для Каждого СтрокаИнв Из СтрокаОС.ПолучитьЭлементы() Цикл
		СтрокаИнв.Пометка = СтрокаОС.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьХарактеристику(Код)
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", Код);
	
КонецФункции

#КонецОбласти
